using System;

namespace DZ_if_26_03_2020
{
    class Program
    {
        static void Main(string[] args)
        {
             /*
             Задание 1
                Выучите основные конструкции и понятия, рассмотренные на уроке
            */
            Console.WriteLine("OK!");
            
            Console.ReadKey();
        }
    }
}
